ОсновныеОбъектыПоМетодичке/src/DataProcessors/ДоступКДаннымДокумента/ДоступКДаннымДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДоступКДаннымДокумента</name>
</mdclass:DataProcessor>

ОсновныеОбъектыПоМетодичке/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.Серии</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОсновныеОбъектыПоМетодичке/src/DataProcessors/ДоступКДаннымДокумента/Forms/Форма/Module.bsl
&НаСервереБезКонтекста
Процедура ЧтениеВсехДокументовНаСервере()

	 Выборка = Документы.ПоступлениеТоваров.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	ТекКонтрагент = Выборка.Контрагент;
		
		Сообщить(ТекКонтрагент);
		
		Для каждого ТекСтрока Из Выборка.Товары Цикл
		
			 Сообщить(ТекСтрока.Номенклатура);
		
		КонецЦикла; 
		
	 
	 КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеВсехДокументов(Команда)
	ЧтениеВсехДокументовНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЧтениеВсехДокументовТабличнаяМодельНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Контрагент,
		|	ПоступлениеТоваров.Товары.(
		|		Номенклатура,
		|		Количество
		|	)
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекКонтрагент = Выборка.Контрагент;
		
		Сообщить(ТекКонтрагент);
		
		ВыборкаДетальныеЗаписи = Выборка.Товары.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			 Сообщить(ВыборкаДетальныеЗаписи.Номенклатура);
		
		КонецЦикла; 
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеВсехДокументовТабличнаяМодель(Команда)
	ЧтениеВсехДокументовТабличнаяМодельНаСервере();
КонецПроцедуры
